src/cf/Documents/НачислениеНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачислениеНалогов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоНалогам</xr:Item>
				<xr:Item>AccumulationRegister.Запасы</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходы</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСФондамиПоСтраховымВзносамУНФ</xr:Item>
				<xr:Item>AccumulationRegister.НДФЛРасчетыНалоговыхАгентовСБюджетом</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийНачислениеНалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Налоги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидНалога</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНалогов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Корреспонденция</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокУплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодИФНС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПоОКАТО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/ДокументыСобытийКалендаряОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДокументыСобытийКалендаряОтчетности</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендарьПодготовкиОтчетности</v8:Type>
						<v8:Type>cfg:CatalogRef.КалендарьПерсональныхЗадачОтчетности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвязанныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеНалогов</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплатыУНФ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыОперацийНачислениеНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийНачислениеНалогов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возмещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АмортизацияВнеоборотныхАктивов</Name>
					<Comment>02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнеоборотныеАктивы</Name>
					<Comment>01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаСчетов</Name>
					<Comment>Служебный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дебиторы</Name>
					<Comment>62.01, 60.02, 68.02, 71.02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредства</Name>
					<Comment>50, 51, 57</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолгосрочныеОбязательства</Name>
					<Comment>67</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
					<Comment>90.01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запасы</Name>
					<Comment>10, 41</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Капитал</Name>
					<Comment>80</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КосвенныеЗатраты</Name>
					<Comment>25</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КраткосрочныеФинансовыеВложения</Name>
					<Comment>58</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредиторы</Name>
					<Comment>60.01, 62.02, 68.01, 70.01, 71.01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитыИЗаймы</Name>
					<Comment>66</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НезавершенноеПроизводство</Name>
					<Comment>20</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НераспределеннаяПрибыль</Name>
					<Comment>84</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрибылиУбытки</Name>
					<Comment>99</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеВнеоборотныеАктивы</Name>
					<Comment>08</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
					<Comment>90.01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеКраткосрочныеОбязательства</Name>
					<Comment>98</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеОборотныеАктивы</Name>
					<Comment>94, 97</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
					<Comment>91.02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходы</Name>
					<Comment>90.07, 90.08</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезервныйИДобавочныйКапитал</Name>
					<Comment>82</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СебестоимостьПродаж</Name>
					<Comment>90.02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТорговаяНаценка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыГосударственныхОрганов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыГосударственныхОрганов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НалоговыйОрган</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрганФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрганПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ВидыНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыНалогов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНалога</Name>
					<Comment>Заполняется для поставляемых данных</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаКВозмещению</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежаИзменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорреспондирующийСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Патенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Патенты</Name>
			<Comment>Патенты на осуществление видов деятельности</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВторогоПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервогоПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНалоговогоОрганаПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПатента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотенциальноВозможныйГодовойДоход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВторогоПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПервогоПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Documents/НачислениеНалогов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Определяет список команд заполнения.
//
// Параметры:
//   КомандыЗаполнения - ТаблицаЗначений - Таблица с командами заполнения. Для изменения.
//       См. описание 1 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

// Осуществляет проверку возможности ввода на основании.
//
Процедура ПроверитьВозможностьВводаНаОснованииНачисленияНалогов(ДанныеЗаполнения, ЗначенияРеквизитов) Экспорт
	
	Если ЗначенияРеквизитов.Свойство("ВидОперации") Тогда
		Если ЗначенияРеквизитов.ВидОперации <> Перечисления.ВидыОперацийНачислениеНалогов.Возмещение Тогда
			ВызватьИсключение НСтр("ru='Поступление на счет можно ввести только на основании возмещения налогов, а не начисления.'");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаНачислениеНалогов, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	&ОрганизацияДляРегОтчетности КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Начисление)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	ТаблицаДокумента.ВидНалога КАК ВидНалога,
	|	ТаблицаДокумента.ВидНалога.СчетУчета КАК СчетУчета,
	|	ТаблицаДокумента.Сумма КАК Сумма,
	|	ТаблицаДокумента.СрокУплаты КАК СрокУплаты,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Начисление)
	|			ТОГДА &НачисленНалог
	|		ИНАЧЕ &ВозмещенНалог
	|	КОНЕЦ КАК СодержаниеПроводки
	|ИЗ
	|	Документ.НачислениеНалогов.Налоги КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|		ИНАЧЕ ТаблицаДокумента.НаправлениеДеятельности
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.ВидНалога КАК ВидНалога,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаДокумента.Подразделение
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ТаблицаДокумента.Корреспонденция КАК СчетУчета,
	|	ТаблицаДокумента.ВидНалога КАК Аналитика,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаДокумента.ЗаказПокупателя
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Начисление)
	|			ТОГДА &Расходы
	|		ИНАЧЕ &Доходы
	|	КОНЕЦ КАК СодержаниеПроводки,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Начисление)
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаДокумента.Сумма
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Начисление)
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРасходов,
	|	ТаблицаДокумента.Сумма КАК Сумма
	|ИЗ
	|	Документ.НачислениеНалогов.Налоги КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И (ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|			ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|			ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Доходы)
	|			ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Начисление)
	|			ТОГДА ТаблицаДокумента.Корреспонденция
	|		ИНАЧЕ ТаблицаДокумента.ВидНалога.СчетУчетаКВозмещению
	|	КОНЕЦ КАК СчетДт,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	0 КАК СуммаВалДт,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Начисление)
	|			ТОГДА ТаблицаДокумента.ВидНалога.СчетУчета
	|		ИНАЧЕ ТаблицаДокумента.Корреспонденция
	|	КОНЕЦ КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	0 КАК СуммаВалКт,
	|	ТаблицаДокумента.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Начисление)
	|			ТОГДА &НачисленНалог
	|		ИНАЧЕ &ВозмещенНалог
	|	КОНЕЦ КАК Содержание
	|ИЗ
	|	Документ.НачислениеНалогов.Налоги КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеНалогов.Начисление)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Подразделение КАК СтруктурнаяЕдиница,
	|	ТаблицаДокумента.Корреспонденция КАК СчетУчета,
	|	ТаблицаДокумента.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаДокумента.Сумма КАК Сумма,
	|	ТаблицаДокумента.Сумма КАК СуммаБезНДС,
	|	ИСТИНА КАК ФиксированнаяСтоимость,
	|	&НачисленНалог КАК СодержаниеПроводки
	|ИЗ
	|	Документ.НачислениеНалогов.Налоги КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И (ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|			ИЛИ ТаблицаДокумента.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты))");
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаНачислениеНалогов);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ОрганизацияДляРегОтчетности", СтруктураДополнительныеСвойства.ДляПроведения.ОрганизацияДляРегОтчетности);
	Запрос.УстановитьПараметр("НачисленНалог", НСтр("ru = 'Начислен налог'"));
	Запрос.УстановитьПараметр("ВозмещенНалог", НСтр("ru = 'Возмещен налог'"));
	Запрос.УстановитьПараметр("Доходы", НСтр("ru = 'Доходы'")); 
	Запрос.УстановитьПараметр("Расходы", НСтр("ru = 'Расходы'")); 
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам", МассивРезультатов[0].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", МассивРезультатов[1].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", МассивРезультатов[2].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", МассивРезультатов[3].Выгрузить());
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Функция СформироватьКвитанцию(Данные, СуммаНалога = Неопределено, СобытиеКалендаря = Неопределено) Экспорт
	
	Макет = Документы.НачислениеНалогов.ПолучитьМакет("КвитанцияСбербанка");
	Область = Макет.ПолучитьОбласть("Печатается");
	Результат = Новый ТабличныйДокумент;
	ЭтоДокумент = ТипЗнч(Данные) = Тип("ДокументСсылка.НачислениеНалогов");
	
	Если ЭтоДокумент Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Налоги.ВидНалога
		|ИЗ
		|	Документ.НачислениеНалогов.Налоги КАК Налоги
		|ГДЕ
		|	Налоги.Ссылка = &Документ");
		
		Запрос.УстановитьПараметр("Документ", Данные);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ВидВзаиморасчетов = Выборка.ВидНалога;
		Иначе
			ВидВзаиморасчетов = Справочники.ВидыНалогов.ПустаяСсылка();
		КонецЕсли;
	Иначе
		ВидВзаиморасчетов = Данные.ВидНалога;
	КонецЕсли;
	
	Если ВидВзаиморасчетов = Справочники.ВидыНалогов.АвансовыйПлатежПриУСН
		ИЛИ ВидВзаиморасчетов = Справочники.ВидыНалогов.ЕдиныйНалогПриУСН
		ИЛИ ВидВзаиморасчетов = Справочники.ВидыНалогов.АвансовыйПлатежПриУСНРасходы
		ИЛИ ВидВзаиморасчетов = Справочники.ВидыНалогов.ЕдиныйНалогПриУСНРасходы
		ИЛИ ВидВзаиморасчетов = Справочники.ВидыНалогов.НДФЛСотрудники
		ИЛИ ВидВзаиморасчетов = Справочники.ВидыНалогов.НДФЛДоходыСвышеПредельнойВеличины
		ИЛИ ВидВзаиморасчетов = Справочники.ВидыНалогов.ПФРНакопительная
		ИЛИ ВидВзаиморасчетов = Справочники.ВидыНалогов.ПФРСтраховая
		ИЛИ ВидВзаиморасчетов = Справочники.ВидыНалогов.ПФРСвыше300ТР
		ИЛИ ВидВзаиморасчетов = Справочники.ВидыНалогов.ТФОМС
		ИЛИ ВидВзаиморасчетов = Справочники.ВидыНалогов.ФФОМС
		ИЛИ ВидВзаиморасчетов = Справочники.ВидыНалогов.ПФРНакопительнаяСотрудники 
		ИЛИ ВидВзаиморасчетов = Справочники.ВидыНалогов.ПФРСтраховаяСотрудники 
		ИЛИ ВидВзаиморасчетов = Справочники.ВидыНалогов.ФОМССотрудники 
		ИЛИ ВидВзаиморасчетов = Справочники.ВидыНалогов.ФСССотрудники
		ИЛИ ВидВзаиморасчетов = Справочники.ВидыНалогов.ЕдиныйНалоговыйПлатеж
		ИЛИ ВидВзаиморасчетов = Справочники.ВидыНалогов.ФиксированныеВзносы_СтраховыеВзносыЕдиныйТариф
		ИЛИ ВидВзаиморасчетов = Справочники.ВидыНалогов.СтраховыеВзносыЕдиныйТариф Тогда
		
		Если СобытиеКалендаря <> Неопределено Тогда
			Период = СобытиеКалендаря.ДатаОкончанияСобытия;
		Иначе		
			Период = ?(ЭтоДокумент, Данные.Дата, Данные.Период);
		КонецЕсли;
		
		ПлательщикЕНП = РегламентированнаяОтчетностьУСН.ПлательщикЕНП(Данные.Организация, Период);
		
		Если ПлательщикЕНП И (ВидВзаиморасчетов <> Справочники.ВидыНалогов.ЕНВД И ВидВзаиморасчетов <> Справочники.ВидыНалогов.ФССТравматизмСотрудники) Тогда
			СформироватьПлатежкуВНалоговую(Данные, Область, Результат, Справочники.ВидыНалогов.ЕдиныйНалоговыйПлатеж, СуммаНалога, Ложь);
		Иначе	
			СформироватьПлатежкуВНалоговую(Данные, Область, Результат, ВидВзаиморасчетов, СуммаНалога, Истина);
		КонецЕсли;
		
	ИначеЕсли ВидВзаиморасчетов = Справочники.ВидыНалогов.ЕНВД Тогда
		
		СформироватьПлатежкуЕНВД(Данные, Область, Результат);
	ИначеЕсли ВидВзаиморасчетов = Справочники.ВидыНалогов.ТорговыйСбор  Тогда
		Если СобытиеКалендаря <> Неопределено Тогда
			Период = СобытиеКалендаря.ДатаОкончанияСобытия;
		Иначе		
			Период = ?(ЭтоДокумент, Данные.Дата, Данные.Период);
		КонецЕсли;
		ЭтоЕНП = РегламентированнаяОтчетностьУСН.ПлательщикЕНП(Данные.Организация, Период);
		СформироватьПлатежкуТорговыйСбор(Данные, Область, Результат, ЭтоЕНП);
	ИначеЕсли ВидВзаиморасчетов = Справочники.ВидыНалогов.ФССТравматизмСотрудники Тогда
		СформироватьПлатежкуПоСтраховымВзносамВФСС(Данные, Область, Результат, ВидВзаиморасчетов, СуммаНалога);
	ИначеЕсли ВидВзаиморасчетов = Справочники.ВидыНалогов.Патент Тогда
		Если СобытиеКалендаря <> Неопределено Тогда
			Период = СобытиеКалендаря.ДатаОкончанияСобытия;
		Иначе		
			Период = ?(ЭтоДокумент, Данные.Дата, Данные.Период);
		КонецЕсли;
		ЭтоЕНП = РегламентированнаяОтчетностьУСН.ПлательщикЕНП(Данные.Организация, Период);
		СформироватьПлатежкуПатент(Данные, Область, Результат, ЭтоЕНП);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СформироватьПлатежкуВНалоговую(Данные, ОбластьМакета, ТабличныйДокумент, ВидВзаиморасчетов, СуммаНалога, НалогУплачиваетсяОтдельно) 
	
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(Данные) = Тип("ДокументСсылка.НачислениеНалогов") Тогда
		Период = Данные.Дата;
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Ссылка КАК Ссылка,
		|	КонтактнаяИнформация.Представление КАК Представление
		|ПОМЕСТИТЬ ВТ_КонтактнаяИнформация
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
		|	И КонтактнаяИнформация.Ссылка = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтактнаяИнформация.ДействуетС УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеНалогов.Организация.КодПоОКАТО КАК ОКАТО,
		|	НачислениеНалогов.Организация.КодПоОКТМО КАК ОКТМО,
		|	НачислениеНалогов.Организация.НаименованиеПолное КАК Плательщик,
		|	НачислениеНалогов.Организация КАК Организация,
		|	НачислениеНалогов.Дата КАК ДатаДокумента,
		|	ОрганизацииКонтактнаяИнформация.Представление КАК АдресПлательщика,
		|	НачислениеНалогов.Организация.ИНН КАК ИННПлательщика,
		|	ЕСТЬNULL(НачислениеНалоговНалоги.Сумма, 0) КАК СуммаВзаиморасчетов,
		|	НачислениеНалогов.Организация.КодНалоговогоОрганаПолучателя КАК КодНалоговогоОрганаПолучателя
		|ИЗ
		|	Документ.НачислениеНалогов КАК НачислениеНалогов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеНалогов.Налоги КАК НачислениеНалоговНалоги
		|		ПО (НачислениеНалоговНалоги.Ссылка = НачислениеНалогов.Ссылка)
		|			И (НачислениеНалоговНалоги.ВидНалога = &ВидНалога)
		|			И (НачислениеНалоговНалоги.НомерСтроки = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|		ПО НачислениеНалогов.Организация.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
		|ГДЕ
		|	НачислениеНалогов.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Данные);
		Запрос.УстановитьПараметр("Организация", Данные);
		Запрос.УстановитьПараметр("ВидНалога", ВидВзаиморасчетов);
		
		Если СуммаНалога <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "НачислениеНалоговНалоги.Сумма", "&Сумма");
			Запрос.УстановитьПараметр("Сумма", СуммаНалога);
		КонецЕсли;
	Иначе 
		Период = Данные.Период;
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Ссылка КАК Ссылка,
		|	КонтактнаяИнформация.Представление КАК Представление,
		|	КонтактнаяИнформация.Вид КАК Вид
		|ПОМЕСТИТЬ ВТ_КонтактнаяИнформация
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
		|	И КонтактнаяИнформация.Ссылка = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтактнаяИнформация.ДействуетС УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Организации.КодПоОКАТО КАК ОКАТО,
		|	Организации.КодПоОКТМО КАК ОКТМО,
		|	Организации.НаименованиеПолное КАК Плательщик,
		|	Организации.Ссылка КАК Организация,
		|	&Период КАК ДатаДокумента,
		|	ОрганизацииКонтактнаяИнформация.Представление КАК АдресПлательщика,
		|	Организации.ИНН КАК ИННПлательщика,
		|	&Сумма КАК СуммаВзаиморасчетов,
		|	Организации.КодНалоговогоОрганаПолучателя КАК КодНалоговогоОрганаПолучателя
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|		ПО Организации.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
		|			И (ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации))
		|ГДЕ
		|	Организации.Ссылка = &Организация";
		Запрос.УстановитьПараметр("Организация", Данные.Организация);
		Запрос.УстановитьПараметр("Сумма", Данные.СуммаДокумента);
		Запрос.УстановитьПараметр("Период", Период);
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ОбластьМакета.Параметры.Заполнить(Выборка); 
		
	Если Не НалогУплачиваетсяОтдельно Тогда
		ОбластьМакета.Параметры.ОКАТО = ЕдиныйНалоговыйСчет.ОКТМОЕдиногоНалоговогоСчета();
		ГосОрган = ЕдиныйНалоговыйСчет.РеквизитыМИДол();
		ОбластьМакета.Параметры.НаименованиеБанкаПолучателя = ГосОрган.ПлатежныеРеквизиты.НаименованиеБанка; 
		ОбластьМакета.Параметры.КоррСчетПолучателя = ГосОрган.ПлатежныеРеквизиты.КоррСчет;  
		ОбластьМакета.Параметры.ИдентификаторНачисления = "0";
	Иначе
		ОбластьМакета.Параметры.ОКАТО = Выборка.ОКТМО;
		ГосОрган = ДанныеГосударственныхОрганов.ГосударственныйОрган(Перечисления.ВидыГосударственныхОрганов.НалоговыйОрган, Выборка.КодНалоговогоОрганаПолучателя); 
		ОбластьМакета.Параметры.НаименованиеБанкаПолучателя = ГосОрган.ПлатежныеРеквизиты.БанкНаименование;		
	КонецЕсли;
	
	ОбластьМакета.Параметры.НаименованиеПолучателяПлатежа = ГосОрган.ПлатежныеРеквизиты.ПолучательПлатежа;
	ОбластьМакета.Параметры.СокращенноеНаименованиеПолучателя = ГосОрган.ПолноеНаименование;
	ОбластьМакета.Параметры.ИННПолучателя = ГосОрган.ИНН;
	ОбластьМакета.Параметры.КПППолучателя = ГосОрган.КПП;	
	ОбластьМакета.Параметры.НомерСчетаПолучателя = ГосОрган.ПлатежныеРеквизиты.РасчетныйСчет;  
	ОбластьМакета.Параметры.БикБанкаПолучателя = ГосОрган.ПлатежныеРеквизиты.БИК;
	
	Рубли = Цел(Выборка.СуммаВзаиморасчетов);
	ОбластьМакета.Параметры["Сумма"] = Рубли;
	
	Копейки = Окр(100 * (Выборка.СуммаВзаиморасчетов - Рубли), 0, 1);
	ОбластьМакета.Параметры["СуммаКопейки"] = Копейки;
	
	ОбластьМакета.Параметры["КБКПлатежа"] = РегламентированнаяОтчетностьУСН.ПолучитьКБКУплаты(Выборка.Организация, Выборка.ДатаДокумента, ВидВзаиморасчетов);
	
	ОбластьМакета.Параметры["НаименованиеПлатежа"] = 
		РегламентированнаяОтчетностьУСНКлиентСервер.ПолучитьТекстНазначенияПлатежаНалогаПоДате(
			Выборка.ДатаДокумента, 
			ВидВзаиморасчетов);
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры

Процедура СформироватьПлатежкуПоСтраховымВзносамВФСС(Данные, ОбластьМакета, ТабличныйДокумент, ВидВзаиморасчетов, СуммаНалога)
	
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(Данные) = Тип("ДокументСсылка.НачислениеНалогов") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Ссылка КАК Ссылка,
		|	КонтактнаяИнформация.Представление КАК Представление
		|ПОМЕСТИТЬ ВТ_КонтактнаяИнформация
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
		|	И КонтактнаяИнформация.Ссылка = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтактнаяИнформация.ДействуетС УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеНалогов.Организация.КодПоОКАТО КАК ОКАТО,
		|	НачислениеНалогов.Организация.КодПоОКТМО КАК ОКТМО,
		|	НачислениеНалогов.Организация.НаименованиеПолное КАК Плательщик,
		|	НачислениеНалогов.Организация КАК Организация,
		|	НачислениеНалогов.Дата КАК ДатаДокумента,
		|	ОрганизацииКонтактнаяИнформация.Представление КАК АдресПлательщика,
		|	НачислениеНалогов.Организация.ИНН КАК ИННПлательщика,
		|	ЕСТЬNULL(НачислениеНалоговНалоги.Сумма, 0) КАК СуммаВзаиморасчетов,
		|	НачислениеНалогов.Организация.КодОрганаФСС КАК КодОрганаФСС,
		|	НачислениеНалогов.Организация.РегистрационныйНомерФСС КАК РегНомерФСС,
		|	НачислениеНалогов.Организация.КодОрганаПФР КАК КодОрганаПФР
		|ИЗ
		|	Документ.НачислениеНалогов КАК НачислениеНалогов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеНалогов.Налоги КАК НачислениеНалоговНалоги
		|		ПО (НачислениеНалоговНалоги.Ссылка = НачислениеНалогов.Ссылка)
		|			И (НачислениеНалоговНалоги.ВидНалога = &ВидНалога)
		|			И (НачислениеНалоговНалоги.НомерСтроки = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|		ПО НачислениеНалогов.Организация.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
		|ГДЕ
		|	НачислениеНалогов.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Данные);
		Запрос.УстановитьПараметр("Организация", Данные.Организация.Ссылка);
		Запрос.УстановитьПараметр("Травматизм", ВидВзаиморасчетов = Справочники.ВидыНалогов.ФССТравматизмСотрудники);
		Запрос.УстановитьПараметр("ВидНалога", ВидВзаиморасчетов);
		Если СуммаНалога <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "НачислениеНалоговНалоги.Сумма", "&Сумма");
			Запрос.УстановитьПараметр("Сумма", СуммаНалога);
		КонецЕсли;
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Ссылка КАК Ссылка,
		|	КонтактнаяИнформация.Представление КАК Представление
		|ПОМЕСТИТЬ ВТ_КонтактнаяИнформация
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
		|	И КонтактнаяИнформация.Ссылка = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтактнаяИнформация.ДействуетС УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Организации.КодПоОКАТО КАК ОКАТО,
		|	Организации.КодПоОКТМО КАК ОКТМО,
		|	Организации.НаименованиеПолное КАК Плательщик,
		|	Организации.Ссылка КАК Организация,
		|	&Период КАК ДатаДокумента,
		|	ОрганизацииКонтактнаяИнформация.Представление КАК АдресПлательщика,
		|	Организации.ИНН КАК ИННПлательщика,
		|	&Сумма КАК СуммаВзаиморасчетов,
		|	Организации.КодОрганаФСС КАК КодОрганаФСС,
		|	Организации.РегистрационныйНомерФСС КАК РегНомерФСС,
		|	Организации.КодОрганаПФР КАК КодОрганаПФР
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|		ПО Организации.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
		|ГДЕ
		|	Организации.Ссылка = &Организация";
		
		Запрос.УстановитьПараметр("Организация", Данные.Организация);
		Запрос.УстановитьПараметр("Сумма", Данные.СуммаДокумента);
		Запрос.УстановитьПараметр("Период", Данные.Период);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	
	ОбластьМакета.Параметры.Заполнить(Выборка);
	ОбластьМакета.Параметры.ОКАТО = Выборка.ОКТМО;
	
	//ФСС теперь входит в СФР(ПФР)
	ГосОрган = ДанныеГосударственныхОрганов.ГосударственныйОрган(Перечисления.ВидыГосударственныхОрганов.ОрганПФР, Выборка.КодОрганаПФР);
	ОбластьМакета.Параметры.НаименованиеПолучателяПлатежа = ГосОрган.ПлатежныеРеквизиты.ПолучательПлатежа;
	ОбластьМакета.Параметры.СокращенноеНаименованиеПолучателя = ГосОрган.ПолноеНаименование;
	ОбластьМакета.Параметры.ИННПолучателя = ГосОрган.ИНН;
	ОбластьМакета.Параметры.КПППолучателя = ГосОрган.КПП;
	ОбластьМакета.Параметры.НомерСчетаПолучателя = ГосОрган.ПлатежныеРеквизиты.РасчетныйСчет;
	ОбластьМакета.Параметры.БикБанкаПолучателя = ГосОрган.ПлатежныеРеквизиты.БИК;
	ОбластьМакета.Параметры.НаименованиеБанкаПолучателя = ГосОрган.ПлатежныеРеквизиты.БанкНаименование;
	
	Рубли = Цел(Выборка.СуммаВзаиморасчетов);
	ОбластьМакета.Параметры["Сумма"] = Рубли;
	
	Копейки = Окр(100 * (Выборка.СуммаВзаиморасчетов - Рубли), 0, 1);
	ОбластьМакета.Параметры["СуммаКопейки"] = Копейки;
	
	ОбластьМакета.Параметры["НомерЛС"] = Выборка.РегНомерФСС;
	
	
	ОбластьМакета.Параметры["КБКПлатежа"] = РегламентированнаяОтчетностьУСН.ПолучитьКБКУплаты(Выборка.Организация, Выборка.ДатаДокумента, ВидВзаиморасчетов);
	
	ОбластьМакета.Параметры["НаименованиеПлатежа"] = 
		РегламентированнаяОтчетностьУСНКлиентСервер.ПолучитьТекстНазначенияПлатежаНалогаПоДате(
			Выборка.ДатаДокумента, 
			ВидВзаиморасчетов,,Выборка.РегНомерФСС);
	
	ТабличныйДокумент.Вывести(ОбластьМакета);

	
КонецПроцедуры

Процедура СформироватьПлатежкуЕНВД(Данные, ОбластьМакета, ТабличныйДокумент) 
	
		
	Запрос = Новый Запрос;
	Если ТипЗнч(Данные) = Тип("ДокументСсылка.НачислениеНалогов") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Ссылка КАК Ссылка,
		|	КонтактнаяИнформация.Представление КАК Представление
		|ПОМЕСТИТЬ ВТ_КонтактнаяИнформация
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
		|	И КонтактнаяИнформация.Ссылка = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтактнаяИнформация.ДействуетС УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеНалоговНалоги.КодИФНС КАК КодИФНС,
		|	НачислениеНалоговНалоги.КодПоОКАТО КАК ОКАТО,
		|	НачислениеНалогов.Организация.НаименованиеПолное КАК Плательщик,
		|	НачислениеНалогов.Организация КАК Организация,
		|	НачислениеНалогов.Дата КАК ДатаДокумента,
		|	ОрганизацииКонтактнаяИнформация.Представление КАК АдресПлательщика,
		|	НачислениеНалогов.Организация.ИНН КАК ИННПлательщика,
		|	ЕСТЬNULL(НачислениеНалоговНалоги.Сумма, 0) КАК СуммаВзаиморасчетов
		|ИЗ
		|	Документ.НачислениеНалогов КАК НачислениеНалогов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеНалогов.Налоги КАК НачислениеНалоговНалоги
		|		ПО (НачислениеНалоговНалоги.Ссылка = НачислениеНалогов.Ссылка)
		|			И (НачислениеНалоговНалоги.ВидНалога = &ВидНалога)
		|			И (НачислениеНалоговНалоги.НомерСтроки = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|		ПО НачислениеНалогов.Организация.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
		|ГДЕ
		|	НачислениеНалогов.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Данные);
		Запрос.УстановитьПараметр("Организация", Данные.Организация);
		Запрос.УстановитьПараметр("ВидНалога", Справочники.ВидыНалогов.ЕНВД);
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Ссылка КАК Ссылка,
		|	КонтактнаяИнформация.Представление КАК Представление
		|ПОМЕСТИТЬ ВТ_КонтактнаяИнформация
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
		|	И КонтактнаяИнформация.Ссылка = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтактнаяИнформация.ДействуетС УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&КодИФНС КАК КодИФНС,
		|	&КодПоОКАТО КАК ОКАТО,
		|	Организации.НаименованиеПолное КАК Плательщик,
		|	Организации.Ссылка КАК Организация,
		|	&Период КАК ДатаДокумента,
		|	ОрганизацииКонтактнаяИнформация.Представление КАК АдресПлательщика,
		|	Организации.ИНН КАК ИННПлательщика,
		|	&Сумма КАК СуммаВзаиморасчетов
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|		ПО Организации.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
		|ГДЕ
		|	Организации.Ссылка = &Организация";
		
		Запрос.УстановитьПараметр("Организация", Данные.Организация);
		Запрос.УстановитьПараметр("Сумма", Данные.СуммаДокумента);
		Запрос.УстановитьПараметр("Период", Данные.Период);
		Запрос.УстановитьПараметр("КодИФНС", Данные.КодИФНСДокумента);
		Запрос.УстановитьПараметр("КодПоОКАТО", Данные.КодОКТМОДокумента);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	
	ОбластьМакета.Параметры.Заполнить(Выборка);
	
	ГосОрган = ДанныеГосударственныхОрганов.ГосударственныйОрган(Перечисления.ВидыГосударственныхОрганов.НалоговыйОрган, Выборка.КодИФНС);
	ОбластьМакета.Параметры.НаименованиеПолучателяПлатежа = ГосОрган.ПлатежныеРеквизиты.ПолучательПлатежа;
	ОбластьМакета.Параметры.СокращенноеНаименованиеПолучателя = ГосОрган.ПолноеНаименование;
	ОбластьМакета.Параметры.ИННПолучателя = ГосОрган.ИНН;
	ОбластьМакета.Параметры.КПППолучателя = ГосОрган.КПП;
	ОбластьМакета.Параметры.НомерСчетаПолучателя = ГосОрган.ПлатежныеРеквизиты.РасчетныйСчет;
	ОбластьМакета.Параметры.БикБанкаПолучателя = ГосОрган.ПлатежныеРеквизиты.БИК;
	ОбластьМакета.Параметры.НаименованиеБанкаПолучателя = ГосОрган.ПлатежныеРеквизиты.Банк;
	
	Рубли = Цел(Выборка.СуммаВзаиморасчетов);
	ОбластьМакета.Параметры["Сумма"] = Рубли;
	
	Копейки = Окр(100 * (Выборка.СуммаВзаиморасчетов - Рубли), 0, 1);
	ОбластьМакета.Параметры["СуммаКопейки"] = Копейки;
	
	ОбластьМакета.Параметры["КБКПлатежа"] = РегламентированнаяОтчетностьУСН.ПолучитьКБКУплаты(Выборка.Организация, Выборка.ДатаДокумента, Справочники.ВидыНалогов.ЕНВД);
	
	ОбластьМакета.Параметры["НаименованиеПлатежа"] = 
		РегламентированнаяОтчетностьУСНКлиентСервер.ПолучитьТекстНазначенияПлатежаНалогаПоДате(
			Выборка.ДатаДокумента, 
			Справочники.ВидыНалогов.ЕНВД);
	
	ТабличныйДокумент.Вывести(ОбластьМакета);

	
КонецПроцедуры

Процедура СформироватьПлатежкуТорговыйСбор(Данные, ОбластьМакета, ТабличныйДокумент, ЭтоЕНП) 
	
		
	Запрос = Новый Запрос;
	Если ТипЗнч(Данные) = Тип("ДокументСсылка.НачислениеНалогов") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Ссылка КАК Ссылка,
		|	КонтактнаяИнформация.Представление КАК Представление
		|ПОМЕСТИТЬ ВТ_КонтактнаяИнформация
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
		|	И КонтактнаяИнформация.Ссылка = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтактнаяИнформация.ДействуетС УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеНалоговНалоги.КодИФНС КАК КодИФНС,
		|	НачислениеНалоговНалоги.КодПоОКАТО КАК ОКАТО,
		|	НачислениеНалогов.Организация.НаименованиеПолное КАК Плательщик,
		|	НачислениеНалогов.Организация КАК Организация,
		|	НачислениеНалогов.Дата КАК ДатаДокумента,
		|	ОрганизацииКонтактнаяИнформация.Представление КАК АдресПлательщика,
		|	НачислениеНалогов.Организация.ИНН КАК ИННПлательщика,
		|	ЕСТЬNULL(НачислениеНалоговНалоги.Сумма, 0) КАК СуммаВзаиморасчетов
		|ИЗ
		|	Документ.НачислениеНалогов КАК НачислениеНалогов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеНалогов.Налоги КАК НачислениеНалоговНалоги
		|		ПО (НачислениеНалоговНалоги.Ссылка = НачислениеНалогов.Ссылка)
		|			И (НачислениеНалоговНалоги.ВидНалога = &ВидНалога)
		|			И (НачислениеНалоговНалоги.НомерСтроки = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|		ПО НачислениеНалогов.Организация.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
		|ГДЕ
		|	НачислениеНалогов.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Данные);
		Запрос.УстановитьПараметр("Организация", Данные.Организация);
		Запрос.УстановитьПараметр("ВидНалога", Справочники.ВидыНалогов.ТорговыйСбор);
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Ссылка КАК Ссылка,
		|	КонтактнаяИнформация.Представление КАК Представление
		|ПОМЕСТИТЬ ВТ_КонтактнаяИнформация
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
		|	И КонтактнаяИнформация.Ссылка = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтактнаяИнформация.ДействуетС УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&КодИФНС КАК КодИФНС,
		|	&КодПоОКАТО КАК ОКАТО,
		|	Организации.НаименованиеПолное КАК Плательщик,
		|	Организации.Ссылка КАК Организация,
		|	&Период КАК ДатаДокумента,
		|	ОрганизацииКонтактнаяИнформация.Представление КАК АдресПлательщика,
		|	Организации.ИНН КАК ИННПлательщика,
		|	&Сумма КАК СуммаВзаиморасчетов
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|		ПО Организации.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
		|ГДЕ
		|	Организации.Ссылка = &Организация";
		
		Запрос.УстановитьПараметр("Организация", Данные.Организация);
		Запрос.УстановитьПараметр("Сумма", Данные.СуммаДокумента);
		Запрос.УстановитьПараметр("Период", Данные.Период);
		Запрос.УстановитьПараметр("КодИФНС", Данные.КодИФНСДокумента);
		Запрос.УстановитьПараметр("КодПоОКАТО", Данные.КодОКТМОДокумента);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	
	ОбластьМакета.Параметры.Заполнить(Выборка);	
		
	Если ЭтоЕНП Тогда
		ОбластьМакета.Параметры.ОКАТО = ЕдиныйНалоговыйСчет.ОКТМОЕдиногоНалоговогоСчета();
		ГосОрган = ЕдиныйНалоговыйСчет.РеквизитыМИДол();
		ОбластьМакета.Параметры.НаименованиеБанкаПолучателя = ГосОрган.ПлатежныеРеквизиты.НаименованиеБанка; 
		ОбластьМакета.Параметры.КоррСчетПолучателя = ГосОрган.ПлатежныеРеквизиты.КоррСчет;  
		ОбластьМакета.Параметры.ИдентификаторНачисления = "0";  
		ОбластьМакета.Параметры["КБКПлатежа"] = РегламентированнаяОтчетностьУСН.ПолучитьКБКУплаты(Выборка.Организация, Выборка.ДатаДокумента, Справочники.ВидыНалогов.ЕдиныйНалоговыйПлатеж);		
		ОбластьМакета.Параметры["НаименованиеПлатежа"] = 
		РегламентированнаяОтчетностьУСНКлиентСервер.ПолучитьТекстНазначенияПлатежаНалогаПоДате(
		Выборка.ДатаДокумента, 
		Справочники.ВидыНалогов.ЕдиныйНалоговыйПлатеж);
	Иначе
		ГосОрган = ДанныеГосударственныхОрганов.ГосударственныйОрган(Перечисления.ВидыГосударственныхОрганов.НалоговыйОрган, Выборка.КодИФНС); 
		ОбластьМакета.Параметры.НаименованиеБанкаПолучателя = ГосОрган.ПлатежныеРеквизиты.Банк;
		РегламентированнаяОтчетностьУСНКлиентСервер.ПолучитьТекстНазначенияПлатежаНалогаПоДате(
		Выборка.ДатаДокумента, 
		Справочники.ВидыНалогов.ТорговыйСбор); 
		ОбластьМакета.Параметры["НаименованиеПлатежа"] = РегламентированнаяОтчетностьУСН.ПолучитьКБКУплаты(Выборка.Организация, Выборка.ДатаДокумента, Справочники.ВидыНалогов.ТорговыйСбор);	
		
		ОбластьМакета.Параметры["КБКПлатежа"] = РегламентированнаяОтчетностьУСН.ПолучитьКБКУплаты(Выборка.Организация, Выборка.ДатаДокумента, Справочники.ВидыНалогов.ТорговыйСбор);
	КонецЕсли;
	
	ОбластьМакета.Параметры.НаименованиеПолучателяПлатежа = ГосОрган.ПлатежныеРеквизиты.ПолучательПлатежа;
	ОбластьМакета.Параметры.СокращенноеНаименованиеПолучателя = ГосОрган.ПолноеНаименование;
	ОбластьМакета.Параметры.ИННПолучателя = ГосОрган.ИНН;
	ОбластьМакета.Параметры.КПППолучателя = ГосОрган.КПП;
	ОбластьМакета.Параметры.НомерСчетаПолучателя = ГосОрган.ПлатежныеРеквизиты.РасчетныйСчет;
	ОбластьМакета.Параметры.БикБанкаПолучателя = ГосОрган.ПлатежныеРеквизиты.БИК;
	
	Рубли = Цел(Выборка.СуммаВзаиморасчетов);
	ОбластьМакета.Параметры["Сумма"] = Рубли;
	
	Копейки = Окр(100 * (Выборка.СуммаВзаиморасчетов - Рубли), 0, 1);
	ОбластьМакета.Параметры["СуммаКопейки"] = Копейки;

	ТабличныйДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры

Процедура СформироватьПлатежкуПатент(Данные, ОбластьМакета, ТабличныйДокумент, ЭтоЕНП = Ложь) 
	
		
	Запрос = Новый Запрос;
	Если ТипЗнч(Данные) = Тип("ДокументСсылка.НачислениеНалогов") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Ссылка КАК Ссылка,
		|	КонтактнаяИнформация.Представление КАК Представление
		|ПОМЕСТИТЬ ВТ_КонтактнаяИнформация
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
		|	И КонтактнаяИнформация.Ссылка = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтактнаяИнформация.ДействуетС УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеНалоговНалоги.КодИФНС КАК КодИФНС,
		|	НачислениеНалоговНалоги.КодПоОКАТО КАК ОКАТО,
		|	НачислениеНалогов.Организация.НаименованиеПолное КАК Плательщик,
		|	НачислениеНалогов.Организация КАК Организация,
		|	НачислениеНалогов.Дата КАК ДатаДокумента,
		|	ОрганизацииКонтактнаяИнформация.Представление КАК АдресПлательщика,
		|	НачислениеНалогов.Организация.ИНН КАК ИННПлательщика,
		|	ЕСТЬNULL(НачислениеНалоговНалоги.Сумма, 0) КАК СуммаВзаиморасчетов,
		|	ЕСТЬNULL(Патент.КБК, """") КАК КБК,
		|	ЕСТЬNULL(Патент.НомерПатента, """") КАК НомерПатента
		|ИЗ
		|	Документ.НачислениеНалогов КАК НачислениеНалогов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеНалогов.Налоги КАК НачислениеНалоговНалоги
		|		ПО (НачислениеНалоговНалоги.Ссылка = НачислениеНалогов.Ссылка)
		|			И (НачислениеНалоговНалоги.ВидНалога = &ВидНалога)
		|			И (НачислениеНалоговНалоги.НомерСтроки = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|		ПО НачислениеНалогов.Организация.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыСобытийКалендаряОтчетности КАК ДокументыСобытийКалендаряОтчетности
		|		ПО (ДокументыСобытийКалендаряОтчетности.СвязанныйДокумент = &Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Патенты КАК Патент
		|		ПО (Патент.Ссылка = ДокументыСобытийКалендаряОтчетности.Событие.Основание)
		|ГДЕ
		|	НачислениеНалогов.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Данные);
		Запрос.УстановитьПараметр("Организация", Данные.Организация.Ссылка);
		Запрос.УстановитьПараметр("ВидНалога", Справочники.ВидыНалогов.Патент);
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Ссылка КАК Ссылка,
		|	КонтактнаяИнформация.Представление КАК Представление
		|ПОМЕСТИТЬ ВТ_КонтактнаяИнформация
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
		|	И КонтактнаяИнформация.Ссылка = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтактнаяИнформация.ДействуетС УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&КодИФНС КАК КодИФНС,
		|	&КодПоОКАТО КАК ОКАТО,
		|	Организации.НаименованиеПолное КАК Плательщик,
		|	Организации.Ссылка КАК Организация,
		|	&Период КАК ДатаДокумента,
		|	ОрганизацииКонтактнаяИнформация.Представление КАК АдресПлательщика,
		|	Организации.ИНН КАК ИННПлательщика,
		|	&Сумма КАК СуммаВзаиморасчетов,
		|	"""" КАК КБК,
		|	"""" КАК НомерПатента
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|		ПО Организации.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
		|ГДЕ
		|	Организации.Ссылка = &Организация";
		
		Запрос.УстановитьПараметр("Организация", Данные.Организация);
		Запрос.УстановитьПараметр("Сумма", Данные.СуммаДокумента);
		Запрос.УстановитьПараметр("Период", Данные.Период);
		Запрос.УстановитьПараметр("КодИФНС", Данные.КодИФНСДокумента);
		Запрос.УстановитьПараметр("КодПоОКАТО", Данные.КодОКТМОДокумента);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	
	ОбластьМакета.Параметры.Заполнить(Выборка);
	
	Если ЭтоЕНП Тогда
		ОбластьМакета.Параметры.ОКАТО = ЕдиныйНалоговыйСчет.ОКТМОЕдиногоНалоговогоСчета();
		ГосОрган = ЕдиныйНалоговыйСчет.РеквизитыМИДол();
		ОбластьМакета.Параметры.НаименованиеБанкаПолучателя = ГосОрган.ПлатежныеРеквизиты.НаименованиеБанка; 
		ОбластьМакета.Параметры.КоррСчетПолучателя = ГосОрган.ПлатежныеРеквизиты.КоррСчет;  
		ОбластьМакета.Параметры.ИдентификаторНачисления = "0"; 
		
		ОбластьМакета.Параметры["КБКПлатежа"] = РегламентированнаяОтчетностьУСН.ПолучитьКБКУплаты(Выборка.Организация, Выборка.ДатаДокумента, Справочники.ВидыНалогов.ЕдиныйНалоговыйПлатеж);
		
		ОбластьМакета.Параметры["НаименованиеПлатежа"] = 
		РегламентированнаяОтчетностьУСНКлиентСервер.ПолучитьТекстНазначенияПлатежаНалогаПоДате(
		Выборка.ДатаДокумента, 
		Справочники.ВидыНалогов.ЕдиныйНалоговыйПлатеж);
	Иначе
		ГосОрган = ДанныеГосударственныхОрганов.ГосударственныйОрган(Перечисления.ВидыГосударственныхОрганов.НалоговыйОрган, Выборка.КодНалоговогоОрганаПолучателя); 
		ОбластьМакета.Параметры.НаименованиеБанкаПолучателя = ГосОрган.ПлатежныеРеквизиты.БанкНаименование;  
		ОбластьМакета.Параметры["КБКПлатежа"] = Выборка.КБК;
		
		ОбластьМакета.Параметры["НаименованиеПлатежа"] = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Уплата налога, взимаемого в связи с применением патентной системы налогообложения, зачисляемого в бюджеты %1, № %2,  НДС не облагается'"),
		Справочники.Патенты.НаправлениеПОКБК(Выборка.КБК),
		Выборка.НомерПатента);

	КонецЕсли;
		
	ОбластьМакета.Параметры.НаименованиеПолучателяПлатежа = ГосОрган.ПлатежныеРеквизиты.ПолучательПлатежа;
	ОбластьМакета.Параметры.СокращенноеНаименованиеПолучателя = ГосОрган.ПолноеНаименование;
	ОбластьМакета.Параметры.ИННПолучателя = ГосОрган.ИНН;
	ОбластьМакета.Параметры.КПППолучателя = ГосОрган.КПП;
	ОбластьМакета.Параметры.НомерСчетаПолучателя = ГосОрган.ПлатежныеРеквизиты.РасчетныйСчет;
	ОбластьМакета.Параметры.БикБанкаПолучателя = ГосОрган.ПлатежныеРеквизиты.БИК;
	
	Рубли = Цел(Выборка.СуммаВзаиморасчетов);
	ОбластьМакета.Параметры["Сумма"] = Рубли;
	
	Копейки = Окр(100 * (Выборка.СуммаВзаиморасчетов - Рубли), 0, 1);
	ОбластьМакета.Параметры["СуммаКопейки"] = Копейки;
	
	
	
	ТабличныйДокумент.Вывести(ОбластьМакета);

	
КонецПроцедуры

#КонецЕсли
